// Например:
// 13:00 = один час
// 13:09 = девять минут первого
// 13:15 = четверть первого
// 13:29 = двадцать девять минут первого
// 13:30 = половина первого
// 13:31 = двадцать девять минут второго
// 13:45 = четверть второго
// 00:48 = двенадцать минут первого
// 00:08 = восемь минут пополуночи
// 12:00 = двенадцать часов
// 00:00 = полночь

// For example:
// 13:00 = one o'clock 
// 13:09 = nine minutes past one 
// 13:15 = quarter past one 
// 13:29 = twenty nine minutes past one
// 13:30 = half past one 
// 13:31 = twenty nine minutes to two
// 13:45 = quarter to two 
// 00:48 = twelve minutes to one
// 00:08 = eight minutes past midnight
// 12:00 = twelve o'clock
// 00:00 = midnight
// Задав время в 24-часовом формате, переведите его в слова.

// Примечание: Если минут == 0, используйте 'o'clock'. Если минут <= 30, используйте 'past', а если минут > 30, используйте 'to'.



function solve(time) {
 
}