// Сортировка массива по индексам в другом массиве. Гарантируется, что оба массива имеют одинаковый размер, а сортировочный массив имеет все необходимые индексы.

// sort(['x', 'y', 'z'], [1, 2, 0]) => ['z', 'x', 'y']

//     sort(['z', 'x', 'y'], [0, 2, 1]) => ['z', 'y', 'x']

const sort = (x, y) => x.map((e,i)=>[e, y[i]]).sort((a, b)=> a[1] - b[1]).map(z => z[0]);


console.log(sort(["x", "y", "z"], [1, 2, 0])); //['z', 'x', 'y']
console.log(sort(["z", "x", "y"], [0, 2, 1])); //['z', 'y', 'x']


// initialArray.map((item, index)=> [item, sortingArray[index]]).sort((a, b) => a[1] - b[1]).map(el => el[0])


// [ [ 'x', 1 ], [ 'y', 2 ], [ 'z', 0 ] ]
// [ [ 'z', 0 ], [ 'x', 2 ], [ 'y', 1 ] ]

// [ [ 'z', 0 ], [ 'x', 1 ], [ 'y', 2 ] ]
// [ [ 'z', 0 ], [ 'y', 1 ], [ 'x', 2 ] ]

